Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG01-S1/atdf/PIC32CK1025SG01064S1.atdf
    <module name="EXTDMA" version="1.0.0" caption="External DMA Module">
      <register-group name="EXTDMA" caption="External DMA Module">
        <register name="FETCH_ADDR_LSB" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Lower Fetch Address">
          <bitfield name="ADDR" caption="Address" mask="0xFFFFFFFF"/>
        </register>
        <register name="FETCH_ADDR_MSB" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Upper Fetch Address">
        </register>
        <register name="FETCH_LEN" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Fetch Length">
          <bitfield name="LEN" caption="Length of data block" mask="0xFFFFFFF"/>
          <bitfield name="CST_ADDR" caption="CST Address" mask="0x10000000"/>
          <bitfield name="REALIGN" caption="Realign" mask="0x20000000"/>
        </register>
        <register name="FETCH_TAG" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="Fetch Tag">
          <bitfield name="TAG" caption="User TAG" mask="0xFFFFFFFF"/>
        </register>
        <register name="PUSH_ADDR_LSB" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Lower Push Address">
          <bitfield name="ADDR" caption="Address" mask="0xFFFFFFFF"/>
        </register>
        <register name="PUSH_ADDR_MSB" offset="0x14" rw="RW" size="4" initval="0x00000000" caption="Upper Fetch Address">
        </register>
        <register name="PUSH_LEN" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="Push Length">
          <bitfield name="LEN" caption="Length of data block" mask="0xFFFFFFF"/>
          <bitfield name="CST_ADDR" caption="CST Address" mask="0x10000000"/>
          <bitfield name="REALIGN" caption="Realign" mask="0x20000000"/>
        </register>
        <register name="INT_EN" offset="0x1C" rw="RW" size="4" caption="Interrupt Enable">
        </register>
        <register name="INT_ENSET" offset="0x20" rw="RW" size="4" atomic-op="set:INT_EN" caption="Interrupt Enable Set">
        </register>
        <register name="INT_ENCLR" offset="0x24" rw="RW" size="4" atomic-op="clear:INT_EN" caption="Interrupt Enable Clear">
        </register>
        <register name="INT_STATRAW" offset="0x28" rw="RW" size="4" caption="Interrupt Raw Status">
        </register>
        <register name="INT_STAT" offset="0x2C" rw="RW" size="4" caption="Interrupt Status">
        </register>
        <register name="INT_STAT_CLR" offset="0x30" rw="RW" size="4" atomic-op="clear:INT_STAT_CLR" caption="Interrupt Status Clear">
        </register>
        <register name="CONFIG" offset="0x34" rw="RW" size="4" caption="Configuraiton">
          <bitfield name="FETCHER_SCATTER_GATHER" caption="" mask="0x1"/>
          <bitfield name="PUSHER_SCATTER_GATHER" caption="" mask="0x2"/>
          <bitfield name="STOP_PUSHER" caption="" mask="0x4"/>
          <bitfield name="STOP_FETCHER" caption="" mask="0x8"/>
          <bitfield name="SOFTWARE_RESET" caption="" mask="0x10"/>
        </register>
        <register name="START" offset="0x38" rw="RW" size="4" caption="Start">
          <bitfield name="START_FETCH" caption="" mask="0x1"/>
          <bitfield name="START_PUSH" caption="" mask="0x2"/>
        </register>
        <register name="STATUS" offset="0x3C" rw="RW" size="4" caption="Stop">
          <bitfield name="FETCHER_BUSY" caption="" mask="0x1"/>
          <bitfield name="PUSHER_BUSY" caption="" mask="0x2"/>
          <bitfield name="BUSY_FLAG" caption="" mask="0x8"/>
          <bitfield name="FETCHER_NOT_EMPTY" caption="" mask="0x10"/>
          <bitfield name="PUSHER_WAITING_FIFO" caption="" mask="0x20"/>
          <bitfield name="BYTES_NUMBER" caption="" mask="0xFFFF0000"/>
        </register>
      </register-group>
    </module>
    <module name="INTCTRL" version="1.0.0" caption="eSecure Interrupt Controller Module">
      <register-group name="INTCTRL" caption="eSecure Interrupt Controller Module">
        <register name="STATL" offset="0x0" rw="R" size="4" initval="0x00000000" caption="Interrupt Status Register Low">
          <bitfield name="RTC" caption="RTC Interrupt" mask="0x1"/>
          <bitfield name="TAMPER" caption="Tamper Interrupt" mask="0x2"/>
          <bitfield name="EXTDMA" caption="External DMA Interrupt" mask="0x4"/>
          <bitfield name="WDOG" caption="Watch Dog Interrupt" mask="0x8"/>
          <bitfield name="TAMPER_BUSY" caption="Tamper Busy Interrupt" mask="0x20"/>
          <bitfield name="TIMER0" caption="Timer 0 Interrupt" mask="0x40"/>
          <bitfield name="TIMER1" caption="Timer 1 interrupt" mask="0x80"/>
          <bitfield name="PWRDOWN" caption="Power Down Interrupt" mask="0x800"/>
          <bitfield name="MB_TX" caption="Mailbox TX Interrupt" mask="0x4000"/>
          <bitfield name="MB_RX" caption="Mailbox RX Interrupt" mask="0x8000"/>
          <bitfield name="CRYPTO0" caption="Crypto Interrupt 0" mask="0x10000"/>
          <bitfield name="CRYPTO1" caption="Crypto Interrupt 1" mask="0x20000"/>
          <bitfield name="CRYPTO2" caption="Crypto Interrupt 2" mask="0x40000"/>
          <bitfield name="CRYPTO3" caption="Crypto Interrupt 3" mask="0x80000"/>
        </register>
        <register name="RSRL" offset="0x8" rw="RW" size="4" atomic-op="clear:RSRL" initval="0x00000000" caption="Interrupt Raw Status Register Low">
          <bitfield name="RTC" caption="RTC Interrupt" mask="0x1"/>
          <bitfield name="TAMPER" caption="Tamper Interrupt" mask="0x2"/>
          <bitfield name="EXTDMA" caption="External DMA Interrupt" mask="0x4"/>
          <bitfield name="WDOG" caption="Watch Dog Interrupt" mask="0x8"/>
          <bitfield name="TAMPER_BUSY" caption="Tamper Busy Interrupt" mask="0x20"/>
          <bitfield name="TIMER0" caption="Timer 0 Interrupt" mask="0x40"/>
          <bitfield name="TIMER1" caption="Timer 1 interrupt" mask="0x80"/>
          <bitfield name="PWRDOWN" caption="Power Down Interrupt" mask="0x800"/>
          <bitfield name="MB_TX" caption="Mailbox TX Interrupt" mask="0x4000"/>
          <bitfield name="MB_RX" caption="Mailbox RX Interrupt" mask="0x8000"/>
          <bitfield name="CRYPTO0" caption="Crypto Interrupt 0" mask="0x10000"/>
          <bitfield name="CRYPTO1" caption="Crypto Interrupt 1" mask="0x20000"/>
          <bitfield name="CRYPTO2" caption="Crypto Interrupt 2" mask="0x40000"/>
          <bitfield name="CRYPTO3" caption="Crypto Interrupt 3" mask="0x80000"/>
        </register>
